**Advanced Pandas Concepts**

In [1]:
import pandas as pd
print(pd.__version__)

2.3.1

**Modify Data**

**1. Adding coloumns**

In [2]:
Employee = {
    "Name":["Ankit sharma","Abhishek kumar","Steve harington","Harsh chaurshiya","Shubham kumar"],
    "Age":[22,24,23,26,27],
    "Salery":[50000,56000,78000,89000,88000]
}

df = pd.DataFrame(Employee)
print(df,"\n")

# Using Assign
df["Bonus"] = df["Salery"]*0.2
print(df,"\n")

# using insert(index,column name,value)
df.insert(0,"ID",[12,24,56,23,67])
print(df)

df.to_excel("Emp_info.xlsx",index=False)

               Name  Age  Salery
0      Ankit sharma   22   50000
1    Abhishek kumar   24   56000
2   Steve harington   23   78000
3  Harsh chaurshiya   26   89000
4     Shubham kumar   27   88000

               Name  Age  Salery    Bonus
0      Ankit sharma   22   50000  10000.0
1    Abhishek kumar   24   56000  11200.0
2   Steve harington   23   78000  15600.0
3  Harsh chaurshiya   26   89000  17800.0
4     Shubham kumar   27   88000  17600.0

   ID              Name  Age  Salery    Bonus
0  12      Ankit sharma   22   50000  10000.0
1  24    Abhishek kumar   24   56000  11200.0
2  56   Steve harington   23   78000  15600.0
3  23  Harsh chaurshiya   26   89000  17800.0
4  67     Shubham kumar   27   88000  17600.0

**2. Updating columns**

In [ ]:
Employee = {
    "Name":["Ankit sharma","Abhishek kumar","Steve Harington","Harsh chaurshiya","Shubham kumar"],
    "Age":[22,24,23,26,27],
    "Salery":[50000,56000,78000,89000,88000]
}

df = pd.DataFrame(Employee)
print(df,"\n")

# .loc[row_index,column name] = Value
df.loc[0,"Salery"] = 56000
print(df,"\n")

# increasing salery by 5%
df["Salery"] = df["Salery"]*1.05
print(df)

**3. Remove columns**

In [ ]:
Employee = {
    "Name":["Ankit sharma","Abhishek kumar","Steve Harington","Harsh chaurshiya","Shubham kumar"],
    "Age":[22,24,23,26,27],
    "Salery":[50000,56000,78000,89000,88000]
}
df = pd.DataFrame(Employee)
print(df,"\n")

# Removing columns 
# df.drop(columns = [columnsName],inplace = True)
print("After delete data")

df.drop(columns=["Age"],inplace=True)
print(df)

**Handling Missing Data**

**1. Find missing Data**

In [3]:
Employee = {
    "Name":["Ankit sharma",None,"Steve Harington","Harsh chaurshiya","Shubham kumar"],
    "Age":[22,24,23,26,27],
    "Salery":[50000,56000,78000,89000,None]
}
df = pd.DataFrame(Employee)
print(df,"\n")

# find missing data 
print(df.isnull(),"\n")

# Calculate missing Data
print(df.isnull().sum())

               Name  Age   Salery
0      Ankit sharma   22  50000.0
1              None   24  56000.0
2   Steve Harington   23  78000.0
3  Harsh chaurshiya   26  89000.0
4     Shubham kumar   27      NaN

    Name    Age  Salery
0  False  False   False
1   True  False   False
2  False  False   False
3  False  False   False
4  False  False    True

Name      1
Age       0
Salery    1
dtype: int64

**2. Drop Missing Data**

In [ ]:
Employee = {
    "Name":["Ankit sharma",None,"Steve Harington","Harsh chaurshiya","Shubham kumar"],
    "Age":[22,24,23,26,27],
    "Salery":[50000,56000,78000,89000,None]
}

df = pd.DataFrame(Employee)
print(df,"\n")

# Drop missing data column
df.dropna(inplace=True)
print(df)

**3. Filling Value where missing data**

In [ ]:
Employee = {
    "Name":["Ankit sharma",None,"Steve Harington","Harsh chaurshiya","Shubham kumar"],
    "Age":[22,24,23,26,27],
    "Salery":[50000,56000,78000,89000,None]
}

df = pd.DataFrame(Employee)
print(df,"\n")

# Fill all NaN with 0
df_filled = df.fillna(0)
print(df_filled,"\n")

# Fill Column-wise with Different Values
df_filled = df.fillna({"Name": df["Age"].mean(), "Salery": df["Salery"].mean()})
print(df_filled)

**4. Interpolation**

In [4]:
Employee = {
    "Name":["Ankit sharma","Sobin kumar","Steve Harington","Harsh chaurshiya","Shubham kumar"],
    "Age":[22,24,23,None,27],
    "Salery":[50000,56000,78000,89000,None]
}

df = pd.DataFrame(Employee)
print(df,"\n")

# Interpolation 
df[["Salery","Age"]] = df[["Salery","Age"]].interpolate(method="linear")
print(df)

               Name   Age   Salery
0      Ankit sharma  22.0  50000.0
1       Sobin kumar  24.0  56000.0
2   Steve Harington  23.0  78000.0
3  Harsh chaurshiya   NaN  89000.0
4     Shubham kumar  27.0      NaN

               Name   Age   Salery
0      Ankit sharma  22.0  50000.0
1       Sobin kumar  24.0  56000.0
2   Steve Harington  23.0  78000.0
3  Harsh chaurshiya  25.0  89000.0
4     Shubham kumar  27.0  89000.0

**Sorting and Aggression**

**1. Sorting**

In [5]:
person = {
    "Name":["Ankit sharma","Abhishek kumar","Steve harington","Harsh chaurshiya","Shubham kumar"],
    "Age":[22,24,23,26,27],
    "Salery":[50000,56000,78000,89000,88000]
}
df = pd.DataFrame(person)
print(df,"\n")
# sorting 
df.sort_values(by="Age",ascending=True,inplace=True)
print("After sorting")
print(df)

               Name  Age  Salery
0      Ankit sharma   22   50000
1    Abhishek kumar   24   56000
2   Steve harington   23   78000
3  Harsh chaurshiya   26   89000
4     Shubham kumar   27   88000

After sorting
               Name  Age  Salery
0      Ankit sharma   22   50000
2   Steve harington   23   78000
1    Abhishek kumar   24   56000
3  Harsh chaurshiya   26   89000
4     Shubham kumar   27   88000

In [6]:
# On multiple values
df.sort_values(by=["Age","Salery"],ascending=[True,True],inplace=True)
print("After sorting")
print(df)

After sorting
               Name  Age  Salery
0      Ankit sharma   22   50000
2   Steve harington   23   78000
1    Abhishek kumar   24   56000
3  Harsh chaurshiya   26   89000
4     Shubham kumar   27   88000

**2. Aggregation**:
Common Aggregation Methods
- sum()
- mean()
- median()
- max()
- min()
- count()
- std() â†’ standard deviation
- var() â†’ variance

In [ ]:
data = {
    "Time":[12,34,56,34],
    "value":[12,45,67,89]
}

df = pd.DataFrame(data)
print(df,"\n")

# Aggregation
Aggr_value = df["value"].agg(["mean","sum","max","median","count","std","var"])
print(Aggr_value)

In [ ]:
Aggr_value = df[["Time","value"]].sum()
print(f"Sum: \n{Aggr_value}")

**3. Grouping**

In [ ]:
data = {
    "Name": ["Ankit", "Sobin", "Steve", "Harsh", "Sobin"],
    "Department": ["IT", "HR", "IT", "Finance", "HR"],
    "Salary": [50000, 56000, 78000, 89000, 56000],
    "Age": [22, 24, 23, 21, 24]
}
df = pd.DataFrame(data)

groupd = df.groupby("Department")["Salary"].sum()
print(groupd)

In [ ]:
# Group by Multiple Columns
groupd = df.groupby(["Department","Age"])["Salary"].sum()
print(groupd)

**Merging and Joining**

**1. Merging**

In [7]:
data1 = {
    "Id":[2,4,8,6,7],
    "Name":["Ramesh","Kalpesh","Suresh","Manish","Kanishk"],
    "Age":[22,18,19,67,34]
}

data2 = {
    "Id":[2,4,8,6,9],
    "Name":["Tanya","Ankita","Khushi","Palak","Ayesha"],
    "Age":[22,18,19,67,34]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

# merge on id
merged = pd.merge(df1,df2,on="Id",how="inner")
print(merged)

   Id   Name_x  Age_x  Name_y  Age_y
0   2   Ramesh     22   Tanya     22
1   4  Kalpesh     18  Ankita     18
2   8   Suresh     19  Khushi     19
3   6   Manish     67   Palak     67

Types of Joins

In [8]:
# inner join
merged = pd.merge(df1,df2,on="Id",how="inner")
print("Inner join")
print(merged)

# outer join
merged = pd.merge(df1,df2,on="Id",how="outer")
print("Outer join")
print(merged,"\n")

# left join
merged = pd.merge(df1,df2,on="Id",how="left")
print("Left join")
print(merged,"\n")

# Right join
merged = pd.merge(df1,df2,on="Id",how="right")
print("Right join")
print(merged,"\n")

Inner join
   Id   Name_x  Age_x  Name_y  Age_y
0   2   Ramesh     22   Tanya     22
1   4  Kalpesh     18  Ankita     18
2   8   Suresh     19  Khushi     19
3   6   Manish     67   Palak     67
Outer join
   Id   Name_x  Age_x  Name_y  Age_y
0   2   Ramesh   22.0   Tanya   22.0
1   4  Kalpesh   18.0  Ankita   18.0
2   6   Manish   67.0   Palak   67.0
3   7  Kanishk   34.0     NaN    NaN
4   8   Suresh   19.0  Khushi   19.0
5   9      NaN    NaN  Ayesha   34.0

Left join
   Id   Name_x  Age_x  Name_y  Age_y
0   2   Ramesh     22   Tanya   22.0
1   4  Kalpesh     18  Ankita   18.0
2   8   Suresh     19  Khushi   19.0
3   6   Manish     67   Palak   67.0
4   7  Kanishk     34     NaN    NaN

Right join
   Id   Name_x  Age_x  Name_y  Age_y
0   2   Ramesh   22.0   Tanya     22
1   4  Kalpesh   18.0  Ankita     18
2   8   Suresh   19.0  Khushi     19
3   6   Manish   67.0   Palak     67
4   9      NaN    NaN  Ayesha     34

**2. Concatination**

In [9]:
data1 = {
    "Id":[2,4,8,6,7],
    "Name":["Ramesh","Kalpesh","Suresh","Manish","Kanishk"],
    "Age":[22,18,19,67,34]
}

data2 = {
    "Id":[2,4,8,6,9],
    "Name":["Tanya","Ankita","Khushi","Palak","Ayesha"],
    "Age":[22,18,19,67,34]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

# Concatenating Row Wise
result = pd.concat([df1,df2],ignore_index=True)
print(result,"\n")

# Column Wise
result = pd.concat([df1,df2],axis=1,ignore_index=True)
print(result)

   Id     Name  Age
0   2   Ramesh   22
1   4  Kalpesh   18
2   8   Suresh   19
3   6   Manish   67
4   7  Kanishk   34
5   2    Tanya   22
6   4   Ankita   18
7   8   Khushi   19
8   6    Palak   67
9   9   Ayesha   34

   0        1   2  3       4   5
0  2   Ramesh  22  2   Tanya  22
1  4  Kalpesh  18  4  Ankita  18
2  8   Suresh  19  8  Khushi  19
3  6   Manish  67  6   Palak  67
4  7  Kanishk  34  9  Ayesha  34

**ðŸ“Œ Notebook Summary**
- Topic: Advanced Pandas Concepts.

- **Covered Concepts:**

1. Adding Columns â€“ Using `assign`, direct assignment, and `insert()`.

2. Updating Columns â€“ Modifying values with `.loc[]`, applying *percentage* *increases*, etc.

3. Removing Columns â€“ Using `drop()`.

4. Sorting Data â€“ Sorting by columns with `sort_values()`.

5. Filtering Data â€“ Boolean indexing and conditional filtering.

6. Handling Missing Values â€“ Using `isnull()`, `dropna()`, and `fillna()`.

7. Interpolation â€“ Filling missing values in *series/columns*.

8. Grouping & Aggregation â€“ With `groupby()` and aggregation functions `(mean, sum, etc.)`.

9. Merging & Joining â€“ Using `merge()`, `concat()`, and `join()`.

- Style: Each section has a markdown explanation followed by code examples.

- Use Case: Acts as a learning notebook for Pandas data manipulation.

# ðŸ“˜ Pandas Practice Questions  

1. Create a DataFrame of employees with columns: `Name`, `Age`, `Salary`. Add a new column `Bonus` = 20% of Salary.  

2. Update the Salary of the first employee in the DataFrame to `60000` using `.loc`.  

3. Increase all salaries by **10%** and update the DataFrame.  

4. Remove the column `Bonus` from the DataFrame permanently.  

5. Sort the DataFrame by `Salary` in **ascending order**.  

6. Sort the DataFrame by `Age` in **descending order**.  

7. Select only those employees whose `Salary` is greater than `70,000`.  

8. Select employees whose `Age` is between `23` and `26`.  

9. Identify missing values in the `Age` column using `isnull()`.  

10. Drop all rows where any value is missing using `dropna()`.  

11. Fill missing values in the `Salary` column with the **mean salary**.  

12. Group employees by `Age` and calculate the **average Salary**.  

13. Group employees by `Age` and find the **maximum Bonus**.  

14. Merge two DataFrames (`df1` with employee details and `df2` with department details) on the column `ID`.  

15. Concatenate two DataFrames vertically (row-wise).